a = 1; b = -5000.002; c=10;

fprintf('1번 근의공식: x1: %f\n', ((-1)*b + sqrt(b^2 - 4*a*c)) / (2*a) );
fprintf('1번 근의공식: x2: %f\n', ((-1)*b - sqrt(b^2 - 4*a*c)) / (2*a) );
fprintf('2번 근의공식: x1: %f\n', -2*c / (b + sqrt(b^2 - 4*a*c)) );
fprintf('2번 근의공식: x2: %f\n', -2*c / (b - sqrt(b^2 - 4*a*c)) );

fprintf('sqrt(b^2-4ac) = %f\n', sqrt(5000.002^2 - 4*1*10));

fprintf('\n버림으로 5자리 연산을 사용한 두 근의공식의 근\n');
fprintf('1번 근의공식: x1: %f\n', (5000.0 + 4999.9) / 2 );
fprintf('1번 근의공식: x2: %f\n', (5000.0 - 4999.9) / 2 );
fprintf('2번 근의공식: x1: %f\n', (-2*10) / (-5000.0 + 4999.9));
fprintf('2번 근의공식: x2: %f\n', (-2*10) / (-5000.0 - 4999.9));