%data
xi = [ 3.0 4.5 7.0 9.0 ];
fi = [ 2.5 1.0 2.5 0.5 ];
h = [ 1.5 2.5 2.0 ];
b = [ 0 0 0 ];
d = [ 0 0 0 ];

% 계수 c를 결정하기 위한 연립방정식 행렬
A = [ 1 0 0 0 ; h(1) 2*(h(1) + h(2)) h(2) 0; 0 h(2) 2*(h(2) + h(3)) h(3); 0 0 0 1 ]
b = [ 0; 3*( (fi(3) - fi(2))/(xi(3)-xi(2)) - (fi(2) - fi(1))/(xi(2)-xi(1)) ); ...
    3*( (fi(4) - fi(3))/(xi(4)-xi(3)) - (fi(3) - fi(2))/(xi(3)-xi(2)) ); 0 ]

c = A\b % c의 해

b1 = ( fi(2) - fi(1) )/h(1) - h(1)*(2*c(1) + c(2))/3;
b2 = ( fi(3) - fi(2) )/h(2) - h(2)*(2*c(2) + c(3))/3;
b3 = ( fi(4) - fi(3) )/h(3) - h(3)*(2*c(3) + c(4))/3;
fprintf('b = [ %f %f %f ]\n', b1, b2, b3);

d1 = (c(2) - c(1))/(3*h(1));
d2 = (c(3) - c(2))/(3*h(2));
d3 = (c(4) - c(3))/(3*h(3));
fprintf('d = [ %f %f %f ] \n', d1, d2, d3);

xx = linspace(3, 9);
yy = interp1(xi, fi, xx, 'spline');   % 선형 스플라인 (각 점을 잇는 직선)
plot(xi, fi, 'o')
hold on;
plot(xx, yy);
hold off;



